In [1]:
import pandas as pd

#### Create DataFrame from dict of equal length lists

In [2]:
#last five olymnics data: place, year and number of countries participated
olympic_data_list = {'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                  'Year':[2012,2008,2004,2000,1996],
                   'No. of Participating Countries':[205,204,201,200,197]
                  }

In [3]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [4]:
df_olympic_data

  HostCity  No. of Participating Countries  Year
0   London                             205  2012
1  Beijing                             204  2008
2   Athens                             201  2004
3   Sydney                             200  2000
4  Atlanta                             197  1996

#### Create DataFrame from dict of dicts

In [5]:
olympic_data_dict = {'London':{2012:205},'Beijing':{2008:204}}

In [6]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [7]:
df_olympic_data_dict

      Beijing  London
2008      204     NaN
2012      NaN     205

In [8]:
#select by City name
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [9]:
#use describe function to display the content
df_olympic_data.describe

<bound method DataFrame.describe of   HostCity  No. of Participating Countries  Year
0   London                             205  2012
1  Beijing                             204  2008
2   Athens                             201  2004
3   Sydney                             200  2000
4  Atlanta                             197  1996>

#### Create DataFrame from dict of series

In [10]:
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                   index=[2012,2008,2004,2000,1996])

In [11]:
df_olympic_series = pd.DataFrame({'No. of Participating Countries':olympic_series_participation,
                                  'Host Cities':olympic_series_country})

In [12]:
df_olympic_series

     Host Cities  No. of Participating Countries
2012      London                             205
2008     Beijing                             204
2004      Athens                             201
2000      Sydney                             200
1996     Atlanta                             197

#### Create DataFrame from dict of ndarray

In [13]:
import numpy as np

In [14]:
np_array = np.array([2012,2008,2004,2006])
dict_ndarray = {'year':np_array}

In [15]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [16]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

#### Create DataFrame from DataFrame object

In [17]:
df_from_df = pd.DataFrame(df_olympic_series)

In [18]:
df_from_df

     Host Cities  No. of Participating Countries
2012      London                             205
2008     Beijing                             204
2004      Athens                             201
2000      Sydney                             200
1996     Atlanta                             197

In [19]:
#view values 
df_from_df.values

array([['London', 205L],
       ['Beijing', 204L],
       ['Athens', 201L],
       ['Sydney', 200L],
       ['Atlanta', 197L]], dtype=object)

#### View dataset

In [20]:
#view top 2 rows of the dataset
df_from_df.head(2)

     Host Cities  No. of Participating Countries
2012      London                             205
2008     Beijing                             204

In [21]:
#view bottom two rows of dataset
df_from_df.tail(2)

     Host Cities  No. of Participating Countries
2000      Sydney                             200
1996     Atlanta                             197

In [22]:
#view indexes of dataset
df_from_df.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [23]:
#view columns of the dataset
df_from_df.columns

Index([u'Host Cities', u'No. of Participating Countries'], dtype='object')

#### Select dataset

In [24]:
#select column name from the dataset
df_from_df['No. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries, dtype: int64

In [25]:
#another selecion by column name
df_from_df['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [26]:
#select elements by index location
df_from_df.loc[2012]

Host Cities                       London
No. of Participating Countries       205
Name: 2012, dtype: object

In [27]:
#select elements by slicing from 0 to 2
df_from_df.iloc[0:2]

     Host Cities  No. of Participating Countries
2012      London                             205
2008     Beijing                             204

In [28]:
#select element by position
df_from_df.iat[2,1]

201

In [29]:
# select element by boolean indexing where countries participated are more than 200
df_from_df[df_from_df['No. of Participating Countries']>200]

     Host Cities  No. of Participating Countries
2012      London                             205
2008     Beijing                             204
2004      Athens                             201